package com.magic.ruoyiapi.domain.dto;

/**
 * @author 1
 */
public enum ResponseCode implements ResponseCodeInterface {

    _100002(100002, "accessKey不能为空"),
    _100003(100003, "非法接入者"),
    _100004(100004, "签名错误"),

    _1000000(1000000, "成功"),
    _1000001(1000001, "系统繁忙"),

    _100008(100008, "应用标识为空"),
    _100009(100009, "应用市场为空"),
    _100010(100010, "设备标识为空"),
    _100011(100011, "平台类型为空"),
    _100012(100012, "应用版本为空"),
    _100013(100013, "已经是最新版本"),
    _100014(100014, "应用不存在"),
    _100015(100015, "应用Id为空"),
    _100016(100016, "应用名为空"),
    _100017(100017, "应用类型为空"),
    _100018(100018, "菜单为空"),
    _100019(100019, "菜单名称为空"),
    _100020(100020, "用户标识为空"),

    _100005(100005, "手机号未注册"),
    _100006(100006, "该手机号已注册"),
    _100007(100007, "验证码错误或失效"),
    _100033(100033, "请输入手机号"),
    _100034(100034, "请输入正确的手机号"),
    _100035(100035, "今日您已获取短信验证码超过5次，请24小时后再试"),
    _100036(100036, "今日您已获取短信验证码超过10次，请24小时后再试"),
    _100037(100037, "请输入验证码"),
    _100046(100046, "验证码暂时不能发送，请一分钟以后再试"),

    _2000001(2000001, "用户不存在"),
    _2000002(2000002, "请输入账号"),
    _2000003(2000003, "输入的两次新密码不一致"),
    _2000004(2000004, "输入的旧密码有误"),
    _2000005(2000005, "输入的昵称为空"),
    _2000006(2000006, "账号或密码错误"),
    _2000007(2000007, "请输入密码"),
    _2000009(2000009, "角色正常使用"),
    _2000011(2000011, "角色不存在"),
    _2000019(2000019, "请输入角色名称"),
    _2000020(2000020, "请选择角色类型"),
    _2000021(2000021, "登录超时或未登录"),
    _2000043(2000043, "参数错误"),
    _2000049(2000049, "此文件不存在"),
    _2000050(2000050, "文件解析错误"),
    _2000051(2000050, "文件导出失败"),
    _2000057(2000057, "参数不能为空"),


    _3000001(3000001, "产品码不能为空"),
    _4000000(4000000, "通道处理请求失败"),
    ;

    private int code;
    private String msg;

    ResponseCode(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    public static ResponseCode valueOf(int code) {
        ResponseCode result = null;
        ResponseCode[] ts = (ResponseCode[]) ResponseCode.class.getEnumConstants();
        for (ResponseCode aps : ts) {
            if (aps.getCode() == code) {
                result = aps;
                break;
            }
        }
        return result;
    }

    public int getCode() {
        return this.code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMsg() {
        return this.msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    @Override
    public String toString() {
        return "ResponseCode{" +
                "code=" + code +
                ", msg='" + msg + '\'' +
                '}';
    }
}
